InformationRegisters/ИсходныеДанныеЗаданийРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсходныеДанныеЗаданийРаспознаваниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильноеПриложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МобильныеПриложенияРаспознаванияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыОбработкиЗаданийРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыОбработкиЗаданийРаспознаваниеДокументов</Name>
			<Comment>Содержит список идентификаторов загруженных документов, а также идентификаторы файлов, из которых документ был собран</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИменаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсходныеДанныеЗаданийРаспознаваниеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоАвторизованныйПользователь(Пользователь)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПереименоватьМобильныеПриложения(Идентификатор, Имя) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторФайла КАК ИдентификаторФайла
			|ИЗ
			|	РегистрСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов КАК ИсходныеДанныеЗаданийРаспознаваниеДокументов
			|ГДЕ
			|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторКлиента = &ИдентификаторКлиента";
		
		Запрос.УстановитьПараметр("ИдентификаторКлиента", Идентификатор);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Менеджер = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
			Менеджер.ИдентификаторФайла = Выборка.ИдентификаторФайла;
			Менеджер.Прочитать();
			
			Менеджер.Отправитель = Имя;
			Менеджер.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Процедура ИзменитьОтветственного(РаспознанныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторФайла КАК ИдентификаторФайла,
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторЗадания КАК ИдентификаторЗадания
		|ИЗ
		|	РегистрСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов КАК РезультатыОбработкиЗаданийРаспознаваниеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов КАК ИсходныеДанныеЗаданийРаспознаваниеДокументов
		|		ПО (РезультатыОбработкиЗаданийРаспознаваниеДокументов.ИдентификаторРезультата = &ИдентификаторРезультата)
		|			И (ИсходныеДанныеЗаданийРаспознаваниеДокументов.Пользователь <> &Пользователь)
		|			И РезультатыОбработкиЗаданийРаспознаваниеДокументов.ИдентификаторФайла = ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторФайла";
	
	Запрос.УстановитьПараметр("ИдентификаторРезультата", РаспознанныйДокумент.ИдентификаторРезультата);
	Запрос.УстановитьПараметр("Пользователь", РаспознанныйДокумент.Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Менеджер = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
			Менеджер.ИдентификаторФайла = Выборка.ИдентификаторФайла;
			Менеджер.Прочитать();
			
			Менеджер.Пользователь = РаспознанныйДокумент.Ответственный;
			Менеджер.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПользователяПоИдЗадания(ИдентификаторЗадания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов КАК ИсходныеДанныеЗаданийРаспознаваниеДокументов
		|ГДЕ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторЗадания = &ИдентификаторЗадания";
	
	Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьМобильноеПриложениеПоИдЗадания(ИдентификаторЗадания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.МобильноеПриложение КАК МобильноеПриложение
		|ИЗ
		|	РегистрСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов КАК ИсходныеДанныеЗаданийРаспознаваниеДокументов
		|ГДЕ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторЗадания = &ИдентификаторЗадания";
	
	Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МобильноеПриложение;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьРезультатыОбработкиПоИдЗадания(ИдентификаторЗадания) Экспорт
	
	ИменаФайлов = Новый Массив;
	ФайлыДокумента = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторФайла КАК ИдентификаторФайла,
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов КАК ИсходныеДанныеЗаданийРаспознаваниеДокументов
		|ГДЕ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторЗадания = &ИдентификаторЗадания";
	
	Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИменаФайлов.Добавить(Выборка.ИмяФайла);
		ФайлыДокумента.Добавить(Выборка.ИдентификаторФайла);
		
	КонецЦикла;
	
	РезультатыОбработки = Новый Структура;
	РезультатыОбработки.Вставить("ИдентификаторРезультата", ИдентификаторЗадания);
	РезультатыОбработки.Вставить("ИменаФайлов", СтрСоединить(ИменаФайлов, ", "));
	РезультатыОбработки.Вставить("ФайлыДокумента", ФайлыДокумента);
	
	Возврат РезультатыОбработки;
	
КонецФункции

Функция ПолучитьЕдинственныйИсходныйФайл(ИдентификаторЗадания) Экспорт
	
	ИнформацияОФайлах = ПолучитьИдентификаторыФайлов(ИдентификаторЗадания);
	Если ИнформацияОФайлах.Количество() = 1 Тогда
		Возврат ИнформацияОФайлах[0].ИсходныйФайл;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьИдентификаторыФайлов(ИдентификаторРезультата) Экспорт
	
	ИдентификаторыФайлов = РегистрыСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов
		.ПолучитьИдФайловПоИдРезультата(ИдентификаторРезультата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторФайла КАК ИдентификаторФайла,
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИсходныйФайл КАК ИсходныйФайл,
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов КАК ИсходныеДанныеЗаданийРаспознаваниеДокументов
		|ГДЕ
		|	ИсходныеДанныеЗаданийРаспознаваниеДокументов.ИдентификаторФайла В (&ИдентификаторыФайлов)";
	
	Запрос.УстановитьПараметр("ИдентификаторыФайлов", ИдентификаторыФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("ИсходныйФайл", Выборка.ИсходныйФайл.Получить());
		ИнформацияОФайле.Вставить("ИмяФайла", Выборка.ИмяФайла);
		Результат.Добавить(ИнформацияОФайле);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьЗаписиПоИдФайлов(ИдентификаторыФайлов) Экспорт
	
	Для Каждого ИдентификаторыФайла Из ИдентификаторыФайлов Цикл
		Набор = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторФайла.Установить(ИдентификаторыФайла);
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
